{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "GAME OVER\n",
    "\n",
    "Бернард смотрит, что происходит в парке в разные моменты времени. Он хочет знать в каком состоянии находились машины в нужное ему время. \n",
    "\n",
    "Они находятся в двух состояниях либо они играют GAME CONTINUES\n",
    "\n",
    "Либо они находятся на починке GAME OVER\n",
    "\n",
    "Вам будут даны интервалы времени, когда роботы находились на починке, и время, которое интересовало Бернарда. \n",
    "\n",
    "Бернард смотрит данные за последний месяц. Поэтому он вводит число и время. \n",
    "\n",
    "Например 2 -е число, 15 часов 13 минут:   2 15:13\n",
    "\n",
    "Входные данные: Сначала идёт список роботов в виде: Имя | даты поломки через запятую в виду \"DD HH:MM\"\n",
    "\n",
    "Потом идёт список времени, которое интересовало Бернарда в формате \"DD HH:MM\"\n",
    "\n",
    "Кол-во роботов не превышает 10, кол-во дат в запросе не больше 10\n",
    "\n",
    "Время ремонта робота включает в себя границы заданных промежутков времени\n",
    "\n",
    "Добавлен идентификатор строки R - роботы, T - время\n",
    "\n",
    "Пример входных данных:\n",
    "\n",
    "R:Тедди| 4 18:12 - 6 19:32, 17 13:12 - 20 14:42\n",
    "\n",
    "R:Долорес| 12 14:12 - 12 18:15\n",
    "\n",
    "R:Мейв| 13 9:21 - 13 21:23, 14 7:23 - 15 12:12 , 17 18:00 - 19 23:22, 22 20:25 - 26 15:14  \n",
    "\n",
    "R:Питер| 8 9:05 - 10 4:55\n",
    "\n",
    "R:Клементина| 15 4:00 - 16 14:43\n",
    "\n",
    "T:8 14:21\n",
    "\n",
    "T:17 19:17\n",
    "\n",
    "Выходные данные: дата, состояния роботов\n",
    "\n",
    "Пример выходных данных: \n",
    "\n",
    "8 14:21\n",
    "\n",
    "Тедди GAME CONTINUES\n",
    "\n",
    "Долорес GAME CONTINUES\n",
    "\n",
    "Мейв GAME CONTINUES\n",
    "\n",
    "Питер GAME OVER\n",
    "\n",
    "Клементина GAME CONTINUES\n",
    "\n",
    "17 19:17\n",
    "\n",
    "Тедди GAME OVER\n",
    "\n",
    "Долорес GAME CONTINUES\n",
    "\n",
    "Мейв GAME OVER\n",
    "\n",
    "Питер GAME CONTINUES\n",
    "\n",
    "Клементина GAME CONTINUES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "flag1 = 'GAME CONTINUES'\n",
    "flag2 = 'GAME OVER'\n",
    "robots = []\n",
    "times = []\n",
    "for line in sys.stdin:\n",
    "    line = line.strip()\n",
    "    if line[0] == 'T':\n",
    "        times.append(line[2:])\n",
    "    if line[0] == 'R':\n",
    "        robots.append(line[2:])\n",
    "\n",
    "for time in times:\n",
    "    print(time)\n",
    "    new_time = time.split()\n",
    "    day = int(new_time[0])\n",
    "    time = new_time[1].split(':')\n",
    "    hour = int(time[0])\n",
    "    minute = int(time[1])\n",
    "    for robot in robots:\n",
    "        idx = robot.index('|')\n",
    "        name = robot[:idx]\n",
    "        new_line = robot[idx+1:].split(',')\n",
    "        flag = flag1\n",
    "        for z in range(len(new_line)):\n",
    "            inter = new_line[z].split('-')\n",
    "            time1 = inter[0].split()\n",
    "            day_1 = int(time1[0])\n",
    "            time_1 = time1[1].split(':')\n",
    "            hour_1 = int(time_1[0])\n",
    "            minute_1 = int(time_1[1])\n",
    "            time2 = inter[1].split()\n",
    "            day_2 = int(time2[0])\n",
    "            time_2 = time2[1].split(':')\n",
    "            hour_2 = int(time_2[0])\n",
    "            minute_2 = int(time_2[1])\n",
    "            if day_1<day<day_2:\n",
    "                flag = flag2\n",
    "            elif day==day_1:\n",
    "                if hour>hour_1:\n",
    "                    flag = flag2\n",
    "                elif hour == hour_1:\n",
    "                    if minute>=minute_1:\n",
    "                        flag = flag2\n",
    "            elif day==day_2:\n",
    "                if hour<hour_2:\n",
    "                    flag=flag2\n",
    "                elif hour==hour_2:\n",
    "                    if minute <= minute_2:\n",
    "                        flag = flag2\n",
    "        print(name, flag)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
