{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Имя Фамилия\n",
    "\n",
    "Эллиот хочет получить все имена и фамилии. Для этого он находит все пары слов, которые идут друг за другом, и начинаются с заглавной буквы, причем далее в слове могут быть только русские буквы. Напишите программу способную это сделать. \n",
    "\n",
    "Если между двумя подходящими словами стоит любой знак кроме пробела, то эту пару слов не считать Именем Фамилией. \n",
    "\n",
    "Входные данные представлены на русском языке и исключают возможность появления трех и более слов, удовлетворяющих условию поиска, подряд. \n",
    "\n",
    "Текст длиной не более 2000 символов\n",
    "\n",
    "Могут встречаться повторяющиеся пробелы, в таком случае подходящая пара остается Именем и Фамилией. Имя и фамилию ищите на русском языке. \n",
    "\n",
    "Пример входных данных: \n",
    "\n",
    "“В качестве выкупа fsociety вынуждает Скотта Ноулза надеть маску fsociety и публично сжечь 5,9 миллиона долларов полученных от взлома. Анджела Мосс продолжает подниматься по карьерной лестнице в E Corp, по-видимому, довольная своей новой корпоративной позицией, и, похоже, отказывается от иска. Джоанна получает подарок на пороге - музыкальную шкатулку со спрятанным под ней телефоном, но пропускает звонок. Эллиот обнаруживает, что действовал под влиянием Мистера Робота, когда думал, что спит. Человек по имени Брок убивает Гидеона, который ранее угрожал сообщить о подозрительном поведении Эллиота в Олсейф ФБР и агенту Доминик ДиПьерро. Эллиот просыпается от диссоциативного состояния, разговаривая по телефону, его приветствует на другом конце провода Тайрелл.”\n",
    "\n",
    "Пример выходных данных: “Скотта Ноулза, Анджела Мосс, Мистера Робота, Олсейф ФБР, Доминик ДиПьерро”"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "\n",
    "for line in sys.stdin:\n",
    "    line = line.split()\n",
    "output = []\n",
    "for word in range(len(line)):\n",
    "    if line[word][0] in 'ЙЦУКЕНГШЩЗХЭЖДЛОРПАВЫФЯЧСМИТБЮ' and word != len(line) - 1:\n",
    "        if line[word + 1][0] in 'ЙЦУКЕНГШЩЗХЭЖДЛОРПАВЫФЯЧСМИТБЮ':\n",
    "            if line[word][-1] in 'йцукенгшщзхъэждлорпавыфячсмитьбю':\n",
    "                if line[word + 1][-1] not in 'йцукенгшщзхъэждлорпавыфячсмитьбюЙЦУКЕНГШЩЗХЪЭЖДЛОРПАВЫФЯЧСМИТЬБЮ':\n",
    "                    output.append(line[word] + ' ' + line[word + 1][:-1])\n",
    "                else:\n",
    "                    output.append(line[word] + ' ' + line[word + 1])\n",
    "print(*output, sep=', ')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
